#### Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
x = pd.Series([10, 20, 30, 40, 50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
x.dtype

dtype('int64')

In [5]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
# Series is a one dimensional array, has an index and data type

In [7]:
data = [450, 650, 870]
index = ['Don', 'Mike', 'Edwin']
sales = pd.Series(data, index=index)
sales.index.name = "Name"
sales.name = "Total sales per year"
sales

Name
Don      450
Mike     650
Edwin    870
Name: Total sales per year, dtype: int64

In [8]:
sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object', name='Name')

In [9]:
sales[0]

450

In [10]:
sales.iloc[0]

450

In [11]:
sales > 500

Name
Don      False
Mike      True
Edwin     True
Name: Total sales per year, dtype: bool

In [12]:
sales[[False, True, True]]

Name
Mike     650
Edwin    870
Name: Total sales per year, dtype: int64

In [13]:
sales[sales > 500]

Name
Mike     650
Edwin    870
Name: Total sales per year, dtype: int64

In [14]:
sales[sales > 500].values

array([650, 870], dtype=int64)

In [15]:
600 in sales

False

In [16]:
2011 in sales

False

In [17]:
650 in sales.values

True

In [18]:
sales.to_dict()

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [19]:
sales_dict = {
    "Don": 534,
    "Mike": 453,
    "Edwin": 412
}
sales_ser = pd.Series(sales_dict)
sales_ser

Don      534
Mike     453
Edwin    412
dtype: int64

In [20]:
new_sales = pd.Series(sales_dict, index=['Don', 'Mike', 'Sally', 'Edwin', 'Lucy'])
new_sales

Don      534.0
Mike     453.0
Sally      NaN
Edwin    412.0
Lucy       NaN
dtype: float64

In [21]:
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [22]:
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [23]:
new_sales.loc['Sally'] is None

False

In [24]:
n = np.nan
n

nan

In [25]:
type(n)

float

In [26]:
new_sales

Don      534.0
Mike     453.0
Sally      NaN
Edwin    412.0
Lucy       NaN
dtype: float64

In [27]:
new_sales.loc['Sally'] = 548
new_sales

Don      534.0
Mike     453.0
Sally    548.0
Edwin    412.0
Lucy       NaN
dtype: float64

In [28]:
new_sales.index.name = "Sales Person"

In [29]:
new_sales.name = "Total TV Sales"

In [30]:
new_sales

Sales Person
Don      534.0
Mike     453.0
Sally    548.0
Edwin    412.0
Lucy       NaN
Name: Total TV Sales, dtype: float64

## Data Frames
- Two Dimensional
- Size mutable
- Heterogenous
- Rows and columns (records and series)

In [31]:
sales_df = pd.DataFrame(new_sales)
sales_df

              Total TV Sales
Sales Person
Don                    534.0
Mike                   453.0
Sally                  548.0
Edwin                  412.0
Lucy                     NaN

In [32]:
data = [['Adrian', 20], ['Bethany', 23], ['Chloe', 41]]
df = pd.DataFrame(data, columns=["Name", "Age"])
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [33]:
new_dict = {
    'Name': ['Tom', 'Jane', 'Steve', 'Lucy'],
    'Sales': [250, 300, 350, 420]
}

df_dict = pd.DataFrame(new_dict)
df_dict

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    420

In [34]:
list_dicts = [
    {'Name': 'Tom', 'Sales' : 300},
    {'Name': 'Greg'},
    {'Name': 'Simone', 'Sales' : 745},
    {'Name': 'Paula', 'Sales' : 542, 'Performance': 'Outstanding'},
    {'Name': 'Yuri', 'Sales' : 453}
]

df_list_dicts = pd.DataFrame(list_dicts)
df_list_dicts

     Name  Sales  Performance
0     Tom  300.0          NaN
1    Greg    NaN          NaN
2  Simone  745.0          NaN
3   Paula  542.0  Outstanding
4    Yuri  453.0          NaN

In [35]:
df_list_dicts['Sales']

0    300.0
1      NaN
2    745.0
3    542.0
4    453.0
Name: Sales, dtype: float64

In [36]:
df_list_dicts['Name']

0       Tom
1      Greg
2    Simone
3     Paula
4      Yuri
Name: Name, dtype: object

In [37]:
df_list_dicts.loc[3]

Name                 Paula
Sales                542.0
Performance    Outstanding
Name: 3, dtype: object

In [38]:
df_list_dicts

     Name  Sales  Performance
0     Tom  300.0          NaN
1    Greg    NaN          NaN
2  Simone  745.0          NaN
3   Paula  542.0  Outstanding
4    Yuri  453.0          NaN

In [39]:
df_list_dicts['Grade'] = ['A', 'A', 'B', 'A', 'C']
df_list_dicts

     Name  Sales  Performance Grade
0     Tom  300.0          NaN     A
1    Greg    NaN          NaN     A
2  Simone  745.0          NaN     B
3   Paula  542.0  Outstanding     A
4    Yuri  453.0          NaN     C

In [40]:
df_list_dicts.drop('Performance', axis=1)

     Name  Sales Grade
0     Tom  300.0     A
1    Greg    NaN     A
2  Simone  745.0     B
3   Paula  542.0     A
4    Yuri  453.0     C

In [41]:
df_list_dicts.drop(1, axis=0)

     Name  Sales  Performance Grade
0     Tom  300.0          NaN     A
2  Simone  745.0          NaN     B
3   Paula  542.0  Outstanding     A
4    Yuri  453.0          NaN     C

In [42]:
df_list_dicts

     Name  Sales  Performance Grade
0     Tom  300.0          NaN     A
1    Greg    NaN          NaN     A
2  Simone  745.0          NaN     B
3   Paula  542.0  Outstanding     A
4    Yuri  453.0          NaN     C

In [43]:
df_list_dicts[['Name', 'Sales', 'Grade']]

     Name  Sales Grade
0     Tom  300.0     A
1    Greg    NaN     A
2  Simone  745.0     B
3   Paula  542.0     A
4    Yuri  453.0     C

In [44]:
df_list_dicts

     Name  Sales  Performance Grade
0     Tom  300.0          NaN     A
1    Greg    NaN          NaN     A
2  Simone  745.0          NaN     B
3   Paula  542.0  Outstanding     A
4    Yuri  453.0          NaN     C

In [45]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])
east

Q1    1000
Q2    1200
Q3    3400
dtype: int64

In [46]:
west

Q1    1100
Q2    1300
Q3    2400
Q4    3500
dtype: int64

In [47]:
df_region = pd.DataFrame({'East':east, 'West': west})
df_region

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [48]:
df_region['North'] = [2000,3000,2500,4000]
df_region['South'] = [1500,2000,1500,4000]
df_region

      East  West  North  South
Q1  1000.0  1100   2000   1500
Q2  1200.0  1300   3000   2000
Q3  3400.0  2400   2500   1500
Q4     NaN  3500   4000   4000

In [49]:
df_region['years'] = ['2016', '2017', '2018', '2019']
df_region

      East  West  North  South years
Q1  1000.0  1100   2000   1500  2016
Q2  1200.0  1300   3000   2000  2017
Q3  3400.0  2400   2500   1500  2018
Q4     NaN  3500   4000   4000  2019

In [52]:
df_region.set_index('years', inplace=True)
df_region

         East  West  North  South
years
2016   1000.0  1100   2000   1500
2017   1200.0  1300   3000   2000
2018   3400.0  2400   2500   1500
2019      NaN  3500   4000   4000

In [53]:
df_region

         East  West  North  South
years
2016   1000.0  1100   2000   1500
2017   1200.0  1300   3000   2000
2018   3400.0  2400   2500   1500
2019      NaN  3500   4000   4000

In [54]:
new_region = df_region.reindex(['2018', '2019', '2020', '2021'])
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [55]:
re_indexed = new_region.reindex(columns=['North', 'South', 'New'])
re_indexed

        North   South  New
years
2018   2500.0  1500.0  NaN
2019   4000.0  4000.0  NaN
2020      NaN     NaN  NaN
2021      NaN     NaN  NaN

## Missing Data

In [56]:
re_indexed.fillna(0)

        North   South  New
years
2018   2500.0  1500.0  0.0
2019   4000.0  4000.0  0.0
2020      0.0     0.0  0.0
2021      0.0     0.0  0.0

In [57]:
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [59]:
new_region.fillna(method='ffill')

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019   3400.0  3500.0  4000.0  4000.0
2020   3400.0  3500.0  4000.0  4000.0
2021   3400.0  3500.0  4000.0  4000.0

In [113]:
new_region.interpolate()

         East    West   North        South  na
years
2018   3400.0  2400.0  2500.0  1500.000000 NaN
2019   4150.0  3500.0  4000.0  4000.000000 NaN
2020   4900.0  4800.0  4400.0  2933.333333 NaN
2021   5650.0  6100.0  4800.0  1866.666667 NaN
2012   6400.0  7400.0  5200.0   800.000000 NaN
2017   3400.0  2400.0  2500.0  1500.000000 NaN

In [115]:
new_region.loc['2022'] = [6400, 7400, 5200, 800]
new_region

ValueError: cannot set a row with mismatched columns

In [116]:
new_region.interpolate().round()

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019   4150.0  3500.0  4000.0  4000.0 NaN
2020   4900.0  4800.0  4400.0  2933.0 NaN
2021   5650.0  6100.0  4800.0  1867.0 NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [117]:
new_region.mean()

East     4400.0
West     3925.0
North    3550.0
South    1950.0
na          NaN
dtype: float64

In [118]:
new_region.fillna(new_region.mean())

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019   4400.0  3500.0  4000.0  4000.0 NaN
2020   4400.0  3925.0  3550.0  1950.0 NaN
2021   4400.0  3925.0  3550.0  1950.0 NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [119]:
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [120]:
new_region.dropna()

Empty DataFrame
Columns: [East, West, North, South, na]
Index: []

In [121]:
new_region.dropna(axis=1, thresh=3)

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN
2012   6400.0  7400.0  5200.0   800.0
2017   3400.0  2400.0  2500.0  1500.0

In [122]:
new_region['na'] = np.nan
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [123]:
new_region.dropna(axis=1, how='all')

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN
2012   6400.0  7400.0  5200.0   800.0
2017   3400.0  2400.0  2500.0  1500.0

In [124]:
new_region.dropna(axis=0, how='any')

Empty DataFrame
Columns: [East, West, North, South, na]
Index: []

In [125]:
new_region.dropna(axis=0, how='all')

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [126]:
new_region.drop(['2020', '2021'])

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [127]:
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [128]:
new_region.loc['2017'] = [3400, 2400, 2500, 1500, np.nan]
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [129]:
new_region.duplicated()

years
2018    False
2019    False
2020    False
2021     True
2012    False
2017     True
dtype: bool

In [130]:
new_region.sort_index()

         East    West   North   South  na
years
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN

In [131]:
new_region.duplicated()

years
2018    False
2019    False
2020    False
2021     True
2012    False
2017     True
dtype: bool

In [132]:
new_region.drop_duplicates()

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN

In [133]:
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [134]:
new_region.West

years
2018    2400.0
2019    3500.0
2020       NaN
2021       NaN
2012    7400.0
2017    2400.0
Name: West, dtype: float64

In [135]:
new_region['West']

years
2018    2400.0
2019    3500.0
2020       NaN
2021       NaN
2012    7400.0
2017    2400.0
Name: West, dtype: float64

In [136]:
new_region[['West', 'East']]

         West    East
years
2018   2400.0  3400.0
2019   3500.0     NaN
2020      NaN     NaN
2021      NaN     NaN
2012   7400.0  6400.0
2017   2400.0  3400.0

In [137]:
new_region.loc['2021']

East    NaN
West    NaN
North   NaN
South   NaN
na      NaN
Name: 2021, dtype: float64

In [138]:
new_region.iloc[2]

East    NaN
West    NaN
North   NaN
South   NaN
na      NaN
Name: 2020, dtype: float64

In [139]:
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [140]:
new_region.iloc[1,2]

4000.0

In [141]:
new_region.iloc[1,2:]

North    4000.0
South    4000.0
na          NaN
Name: 2019, dtype: float64

In [142]:
new_region[new_region.North >= 4000]

         East    West   North   South  na
years
2019      NaN  3500.0  4000.0  4000.0 NaN
2012   6400.0  7400.0  5200.0   800.0 NaN

In [143]:
new_region['East'] + new_region['South']

years
2018    4900.0
2019       NaN
2020       NaN
2021       NaN
2012    7200.0
2017    4900.0
dtype: float64

In [145]:
new_region['East'].add(new_region['South'], fill_value=0).add(new_region['West'], fill_value=0).add(new_region['North'], fill_value=0)

years
2018     9800.0
2019    11500.0
2020        NaN
2021        NaN
2012    19800.0
2017     9800.0
dtype: float64

In [146]:
new_region.sum(axis=1)

years
2018     9800.0
2019    11500.0
2020        0.0
2021        0.0
2012    19800.0
2017     9800.0
dtype: float64

In [147]:
new_region.sum()

East     13200.0
West     15700.0
North    14200.0
South     7800.0
na           0.0
dtype: float64

In [148]:
new_region

         East    West   North   South  na
years
2018   3400.0  2400.0  2500.0  1500.0 NaN
2019      NaN  3500.0  4000.0  4000.0 NaN
2020      NaN     NaN     NaN     NaN NaN
2021      NaN     NaN     NaN     NaN NaN
2012   6400.0  7400.0  5200.0   800.0 NaN
2017   3400.0  2400.0  2500.0  1500.0 NaN

In [154]:
new_region['Total']

years
2018     9800.0
2019    11500.0
2020        NaN
2021        NaN
2012    19800.0
2017     9800.0
Name: Total, dtype: float64

In [156]:
new_region.mean()

East      4400.0
West      3925.0
North     3550.0
South     1950.0
Total    12725.0
dtype: float64

In [157]:
new_region.sum()

East     13200.0
West     15700.0
North    14200.0
South     7800.0
Total    50900.0
dtype: float64

In [158]:
new_region.sum(axis=1)

years
2018    19600.0
2019    23000.0
2020        0.0
2021        0.0
2012    39600.0
2017    19600.0
dtype: float64

In [159]:
new_region.sort_index().cumsum()

          East     West    North   South    Total
years
2012    6400.0   7400.0   5200.0   800.0  19800.0
2017    9800.0   9800.0   7700.0  2300.0  29600.0
2018   13200.0  12200.0  10200.0  3800.0  39400.0
2019       NaN  15700.0  14200.0  7800.0  50900.0
2020       NaN      NaN      NaN     NaN      NaN
2021       NaN      NaN      NaN     NaN      NaN

In [160]:
new_region.min()

East     3400.0
West     2400.0
North    2500.0
South     800.0
Total    9800.0
dtype: float64

In [161]:
new_region.max()

East      6400.0
West      7400.0
North     5200.0
South     4000.0
Total    19800.0
dtype: float64

In [162]:
new_region.std()

East     1732.050808
West     2373.991014
North    1307.669683
South    1405.939781
Total    4784.262395
dtype: float64